#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Created by winchoo
# 2018/5/27

#################################字典的value可以是任何值
# info = {
#     "k1":18,
#     "k2":True,
#     "k3":[
#         11,
#         [],
#         (),
#         22,
#         33,
#         {
#             "kk1":"vv1",
#             "kk2":"vv2",
#             "kk3":(11,22),
#         }
#     ],
#     "k4":(11,22,33,44)
# }
# print(info)

#################################列表、字典不能作为字典的key
#由于True表示1，False表示0，并且key重复时（这里1:"aaa"与True:122重复）只保留一个，所以这里没有显示布尔值
# info = {
#     1:"aaa",
#     "k1":"bbb",
#     True:122,
#     #[1,2]:22,
#     (1,2):22,
#     #{"k1":"v1"}:22
# }
# print(info)

#注意：字典是无序的

######################################通过key来取值，索引方式找到11这个值
# info = {
#     "k1":18,
#     "k2":True,
#     "k3":[
#         11,
#         [],
#         (),
#         22,
#         33,
#         {
#             "kk1":"vv1",
#             "kk2":"vv2",
#             "kk3":(11,22),
#         }
#     ],
#     "k4":(11,22,33,44)
# }
# v = info["k3"][5]["kk3"][0]
# print(v)
# v = info["k1"]####取出指定key的值
# print(v)

######################################字典支持del删除操作，删除一个键值对
# info = {
#     "k1":18,
#     "k2":True,
#     "k3":[
#         11,
#         [],
#         (),
#         22,
#         33,
#         {
#             "kk1":"vv1",
#             "kk2":"vv2",
#             "kk3":(11,22),
#         }
#     ],
#     "k4":(11,22,33,44)
# }
# del info["k1"]
# print(info)

####################################删除kk1这个键值对
# info = {
#     "k1":18,
#     "k2":True,
#     "k3":[
#         11,
#         [],
#         (),
#         22,
#         33,
#         {
#             "kk1":"vv1",
#             "kk2":"vv2",
#             "kk3":(11,22),
#         }
#     ],
#     "k4":(11,22,33,44)
# }
# del info["k3"][5]["kk1"]
# print(info)

###################################字典支持for循环
# info = {
#     "k1":18,
#     "k2":True,
#     "k3":[
#         11,
#         [],
#         (),
#         22,
#         33,
#         {
#             "kk1":"vv1",
#             "kk2":"vv2",
#             "kk3":(11,22),
#         }
#     ],
#     "k4":(11,22,33,44)
# }
# for item in info:
#     print(item)

##################################取出键值对
# for k,v in info.items():
#     print(k,v)

##################################取出键
# for item in info.keys():
#     print(item)

##################################取出值
# for item in info.values():
#     print(item)